CTSI/DealProcessorSoapBinding.dispatchCommandIPOS.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="http://impl.websvc">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns1:dispatchCommandIPOS>
   <in0></in0>
   <in1></in1>
  </ns1:dispatchCommandIPOS>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
